app/Controllers/Tasks.php

SELECT *
FROM `users`
 LIMIT 1
---
    public function profile()
    {
        $userModel = new UserModel();

        return view('profile', [
            'user' => $userModel->first(),
        ]);