app/Models/TaskModel.php

    public function getTodayTasks()
    {
        return $this->where('task_date', date('Y-m-d'))
                    ->orderBy('task_date', 'ASC')
                    ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-28'
ORDER BY `task_date` ASC

    public function getAllTasks()
    {
        return $this->orderBy('task_date', 'ASC')
                    ->orderBy('id', 'ASC')
                    ->findAll();
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `id` ASC